frames.org
#+title: frames
#+roam_alias: framing
#+spotify_href: spotify:track:2MYPFXScWdR3PQihBQxu7x

[[file:marrs_levels.org][Marr's Levels]] framework:
- computational: Goals
- algorithmic: [[file:frames.org][frames]]
- implementation: [[file:current.org][current things I'm doing]]


Man, this one is gonna get so cool once I have transclusion. can be like, frames galore!~

Warning: this document is gonna get big. In order to avoid the "storing acorns for the winter effect" as I call it, we have to cross-list important frames and *link* stuff.

This note contains both meta-information that informs my conception of frames, as well as examples of powerful frames themselves.

Some of these are sort of procedures/algorithms. Like search and storing config files.

I want to be able to seamlessy activate different mental frames, and apply them to the game that I'm currently playing.

I definitely have a note /full/ of stuff like this somewhere in the constellation.

* Meta-information on frames
  
There is no pure hierarchy of things. So I think.

But frames establish a structure. Maybe. They're a constraint on our patterns of thought.

Pictures = mental keys, unlock what’s already inside our heads. 

So what is intelligence?

I think that ultimately a sea of non-concreteness is no way to live a life. You need something concrete, something organizing. A religion, a philosophy, a fundamental axiom, something that you hold sacred. But.... it should not be too concrete of a sacred item. And it should be mutable. 

I need direction in life. That would realize my potential.

Design thinking—say the first thing in your mind, then iterate.

** What is a frame?
*** An if-then rule
*** A mindset/mind backdrop
    Like, either something that sort of leaks subconsciously and influences eveything else, or something that I consciously put into place. Which leads into the next bullet...
*** A set of constraints
*** An idea space?
** External thoughts on framing
*** Kahneman/priming, experimental operationalizations, visakanv thinking/infinite games, Literal Banana against scientific operationalization (restricting frame,)
*** Minsky against math education as a skimpily-connected frame,
*** Hofstadter on [[file:analogy.org][analogy]]/concepts, tetris effect
    There is so, so much to unpack here.
*** Central tenets of framing ([[http://sadfor.us/wp-content/uploads/2017/09/Dont-Think-of-an-Elephant.pdf][Lakoff 2004]])
**** a. Every word has a frame.
**** b. Negating a frame evokes that frame. (cf. Hypothesis N)
**** c. Evoking a frame reenforces that frame.
** Operations on frames
*** Stretching frames
frames like being stretched in certain directions. Some directions fit like a glove. However, some directions...it just doesn't work out. For example -- "organize everything" according to some organizational philosophy...it's awesome for physical possessions, pretty good for digital ones too. But how about mental possessions? that's a little bit sketch.
*** Re-framing
Like...modify the frame.
Example: [[https://www.quantamagazine.org/the-useless-perspective-that-transformed-mathematics-20200609/][representation theory]].
* Bad frames
** Perfectionism
   Trying to optimize things that are ultimately meaningless, or that are hindering progress on what's /actually/ important.
** Toxic Comparison/Competition
   Like, the kind that makes you feel bad inside. 
** "I need to figure everything out now!!"
   Probably related to perfectionism in some base way. Trying to come to an analytical solution when it'd be way easier to implement an iterative one.
* [[http://donellameadows.org/archives/leverage-points-places-to-intervene-in-a-system/][Leverage points: Places to Intervene in a System]]
  Lots of stuff about systems thinking in this one.
** PLACES TO INTERVENE IN A SYSTEM
(in increasing order of effectiveness)
*** Constants, parameters, numbers (such as subsidies, taxes, standards).
*** The sizes of buffers and other stabilizing stocks, relative to their flows.
*** The structure of material stocks and flows (such as transport networks, population age structures).
*** The lengths of delays, relative to the rate of system change.
*** The strength of negative feedback loops, relative to the impacts they are trying to correct against.
*** The gain around driving positive feedback loops.
*** The structure of information flows (who does and does not have access to information).
*** The rules of the system (such as incentives, punishments, constraints).
*** The power to add, change, evolve, or self-organize system structure.
*** The goals of the system.
*** The mindset or paradigm out of which the system — its goals, structure, rules, delays, parameters — arises.
*** The power to transcend paradigms.
* mastering the most basic skills and moving up
Master your tools. Vim is a strong metonymy for thinking about this example.
* noticing inefficiencies
* [[https://twitter.com/david_perell/status/1277088921097125888?s=21][treat your craft like an athlete treats their sport.]]
being prolific is important, incorporating high-signal feedback is also important. World-class athletes do both. So...what's my training regimen for what I wanna do?

This applies quite directly for workout and diet. It's a closed system.

@visakanv is right. build 100 things.
* build 100 things. / Be prolific (Picasso, @visakanv, etc.).
