frames.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-15 Thu 22:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>frames</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ketan Agrawal" />
</head>
<body>
<div id="content">
<h1 class="title">frames</h1>
<p>
<a href="marrs_levels.html">Marr&rsquo;s Levels</a> framework:
</p>
<ul class="org-ul">
<li>computational: Goals</li>
<li>algorithmic: <a href="frames.html">frames</a></li>
<li>implementation: <a href="current.html">current things I&rsquo;m doing</a></li>
</ul>


<p>
Man, this one is gonna get so cool once I have transclusion. can be like, frames galore!~
</p>

<p>
Warning: this document is gonna get big. In order to avoid the &ldquo;storing acorns for the winter effect&rdquo; as I call it, we have to cross-list important frames and <b>link</b> stuff.
</p>

<p>
This note contains both meta-information that informs my conception of frames, as well as examples of powerful frames themselves.
</p>

<p>
Some of these are sort of procedures/algorithms. Like search and storing config files.
</p>

<p>
I want to be able to seamlessy activate different mental frames, and apply them to the game that I&rsquo;m currently playing.
</p>

<p>
I definitely have a note <i>full</i> of stuff like this somewhere in the constellation.
</p>

<div id="outline-container-org6dc82be" class="outline-2">
<h2 id="org6dc82be">Meta-information on frames</h2>
<div class="outline-text-2" id="text-org6dc82be">
<p>
There is no pure hierarchy of things. So I think.
</p>

<p>
But frames establish a structure. Maybe. They&rsquo;re a constraint on our patterns of thought.
</p>

<p>
Pictures = mental keys, unlock what’s already inside our heads. 
</p>

<p>
So what is intelligence?
</p>

<p>
I think that ultimately a sea of non-concreteness is no way to live a life. You need something concrete, something organizing. A religion, a philosophy, a fundamental axiom, something that you hold sacred. But&#x2026;. it should not be too concrete of a sacred item. And it should be mutable. 
</p>

<p>
I need direction in life. That would realize my potential.
</p>

<p>
Design thinking—say the first thing in your mind, then iterate.
</p>
</div>

<div id="outline-container-orgfabe676" class="outline-3">
<h3 id="orgfabe676">What is a frame?</h3>
<div class="outline-text-3" id="text-orgfabe676">
</div>
<div id="outline-container-orgac14f34" class="outline-4">
<h4 id="orgac14f34">An if-then rule</h4>
</div>
<div id="outline-container-org909b00d" class="outline-4">
<h4 id="org909b00d">A mindset/mind backdrop</h4>
<div class="outline-text-4" id="text-org909b00d">
<p>
Like, either something that sort of leaks subconsciously and influences eveything else, or something that I consciously put into place. Which leads into the next bullet&#x2026;
</p>
</div>
</div>
<div id="outline-container-orgd0827b8" class="outline-4">
<h4 id="orgd0827b8">A set of constraints</h4>
</div>
<div id="outline-container-org7f53949" class="outline-4">
<h4 id="org7f53949">An idea space?</h4>
</div>
</div>
<div id="outline-container-orgc4c9215" class="outline-3">
<h3 id="orgc4c9215">External thoughts on framing</h3>
<div class="outline-text-3" id="text-orgc4c9215">
</div>
<div id="outline-container-org055b5fa" class="outline-4">
<h4 id="org055b5fa">Kahneman/priming, experimental operationalizations, visakanv thinking/infinite games, Literal Banana against scientific operationalization (restricting frame,)</h4>
</div>
<div id="outline-container-orgccad92d" class="outline-4">
<h4 id="orgccad92d">Minsky against math education as a skimpily-connected frame,</h4>
</div>
<div id="outline-container-org8360c3d" class="outline-4">
<h4 id="org8360c3d">Hofstadter on <a href="analogy.html">analogy</a>/concepts, tetris effect</h4>
<div class="outline-text-4" id="text-org8360c3d">
<p>
There is so, so much to unpack here.
</p>
</div>
</div>
<div id="outline-container-org4863c03" class="outline-4">
<h4 id="org4863c03">Central tenets of framing (<a href="http://sadfor.us/wp-content/uploads/2017/09/Dont-Think-of-an-Elephant.pdf">Lakoff 2004</a>)</h4>
<div class="outline-text-4" id="text-org4863c03">
</div>
<ul class="org-ul">
<li><a id="org37b6cd6"></a>a. Every word has a frame.<br /></li>
<li><a id="org542d2d2"></a>b. Negating a frame evokes that frame. (cf. Hypothesis N)<br /></li>
<li><a id="orgb2ba715"></a>c. Evoking a frame reenforces that frame.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org638e795" class="outline-3">
<h3 id="org638e795">Operations on frames</h3>
<div class="outline-text-3" id="text-org638e795">
</div>
<div id="outline-container-org999c62f" class="outline-4">
<h4 id="org999c62f">Stretching frames</h4>
<div class="outline-text-4" id="text-org999c62f">
<p>
frames like being stretched in certain directions. Some directions fit like a glove. However, some directions&#x2026;it just doesn&rsquo;t work out. For example &#x2013; &ldquo;organize everything&rdquo; according to some organizational philosophy&#x2026;it&rsquo;s awesome for physical possessions, pretty good for digital ones too. But how about mental possessions? that&rsquo;s a little bit sketch.
</p>
</div>
</div>
<div id="outline-container-org2b1ef4c" class="outline-4">
<h4 id="org2b1ef4c">Re-framing</h4>
<div class="outline-text-4" id="text-org2b1ef4c">
<p>
Like&#x2026;modify the frame.
Example: <a href="https://www.quantamagazine.org/the-useless-perspective-that-transformed-mathematics-20200609/">representation theory</a>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd86b5be" class="outline-2">
<h2 id="orgd86b5be">Bad frames</h2>
<div class="outline-text-2" id="text-orgd86b5be">
</div>
<div id="outline-container-org1fa62e4" class="outline-3">
<h3 id="org1fa62e4">Perfectionism</h3>
<div class="outline-text-3" id="text-org1fa62e4">
<p>
Trying to optimize things that are ultimately meaningless, or that are hindering progress on what&rsquo;s <i>actually</i> important.
</p>
</div>
</div>
<div id="outline-container-orgd398571" class="outline-3">
<h3 id="orgd398571">Toxic Comparison/Competition</h3>
<div class="outline-text-3" id="text-orgd398571">
<p>
Like, the kind that makes you feel bad inside. 
</p>
</div>
</div>
<div id="outline-container-org86fccdf" class="outline-3">
<h3 id="org86fccdf">&ldquo;I need to figure everything out now!!&rdquo;</h3>
<div class="outline-text-3" id="text-org86fccdf">
<p>
Probably related to perfectionism in some base way. Trying to come to an analytical solution when it&rsquo;d be way easier to implement an iterative one.
</p>
</div>
</div>
</div>
<div id="outline-container-org7a9a436" class="outline-2">
<h2 id="org7a9a436"><a href="http://donellameadows.org/archives/leverage-points-places-to-intervene-in-a-system/">Leverage points: Places to Intervene in a System</a></h2>
<div class="outline-text-2" id="text-org7a9a436">
<p>
Lots of stuff about systems thinking in this one.
</p>
</div>
<div id="outline-container-orgd9aa3bd" class="outline-3">
<h3 id="orgd9aa3bd">PLACES TO INTERVENE IN A SYSTEM</h3>
<div class="outline-text-3" id="text-orgd9aa3bd">
<p>
(in increasing order of effectiveness)
</p>
</div>
<div id="outline-container-org186e9d6" class="outline-4">
<h4 id="org186e9d6">Constants, parameters, numbers (such as subsidies, taxes, standards).</h4>
</div>
<div id="outline-container-org00914e6" class="outline-4">
<h4 id="org00914e6">The sizes of buffers and other stabilizing stocks, relative to their flows.</h4>
</div>
<div id="outline-container-org7f04678" class="outline-4">
<h4 id="org7f04678">The structure of material stocks and flows (such as transport networks, population age structures).</h4>
</div>
<div id="outline-container-orge01785d" class="outline-4">
<h4 id="orge01785d">The lengths of delays, relative to the rate of system change.</h4>
</div>
<div id="outline-container-orgb3cab52" class="outline-4">
<h4 id="orgb3cab52">The strength of negative feedback loops, relative to the impacts they are trying to correct against.</h4>
</div>
<div id="outline-container-org325e9cd" class="outline-4">
<h4 id="org325e9cd">The gain around driving positive feedback loops.</h4>
</div>
<div id="outline-container-org369618c" class="outline-4">
<h4 id="org369618c">The structure of information flows (who does and does not have access to information).</h4>
</div>
<div id="outline-container-orgb853813" class="outline-4">
<h4 id="orgb853813">The rules of the system (such as incentives, punishments, constraints).</h4>
</div>
<div id="outline-container-org0686675" class="outline-4">
<h4 id="org0686675">The power to add, change, evolve, or self-organize system structure.</h4>
</div>
<div id="outline-container-orga0eedf1" class="outline-4">
<h4 id="orga0eedf1">The goals of the system.</h4>
</div>
<div id="outline-container-orgead1d53" class="outline-4">
<h4 id="orgead1d53">The mindset or paradigm out of which the system — its goals, structure, rules, delays, parameters — arises.</h4>
</div>
<div id="outline-container-orgd9485e4" class="outline-4">
<h4 id="orgd9485e4">The power to transcend paradigms.</h4>
</div>
</div>
</div>
<div id="outline-container-org275e85e" class="outline-2">
<h2 id="org275e85e">mastering the most basic skills and moving up</h2>
<div class="outline-text-2" id="text-org275e85e">
<p>
Master your tools. Vim is a strong metonymy for thinking about this example.
</p>
</div>
</div>
<div id="outline-container-org9d93790" class="outline-2">
<h2 id="org9d93790">noticing inefficiencies</h2>
</div>
<div id="outline-container-org762836f" class="outline-2">
<h2 id="org762836f"><a href="https://twitter.com/david_perell/status/1277088921097125888?s=21">treat your craft like an athlete treats their sport.</a></h2>
<div class="outline-text-2" id="text-org762836f">
<p>
being prolific is important, incorporating high-signal feedback is also important. World-class athletes do both. So&#x2026;what&rsquo;s my training regimen for what I wanna do?
</p>

<p>
This applies quite directly for workout and diet. It&rsquo;s a closed system.
</p>

<p>
@visakanv is right. build 100 things.
</p>
</div>
</div>
<div id="outline-container-org121a89e" class="outline-2">
<h2 id="org121a89e">build 100 things. / Be prolific (Picasso, @visakanv, etc.).</h2>
</div>
