frames.org
* /mise en place/
Set up the kitchen before cooking.
* Sometimes, when there are explosively many choices, just take the greedy option and
* Changing the settings
like in this thought (link is slow -- hmm...how could I improve this?)
* [[file:marrs_levels.org][Marr's levels]]
* structure as a constraint that leads to creativity.
  Like, it prevents you from spending too much time in the "config layer." Spend more time in the execution layer. But the perennial question is, "how much structure is too much structure?"
* Constraints => creativity
:PROPERTIES:
:ID:       afa561a8-e884-4a81-be70-f580dd72730f
:END:
* (avoid) competitive mindset
* Subtree frame vs. separate page frame
In the context of zettelkasten. These should be interchangeable, imo. (Yet another argument for a graph database backend 😅)
* Constantly staying in motion. Embracing change.
* you are what you eat.
* Repeatedly asking why. Get to the root.
* Light, playful frame.
* Constraints
* Keep It Simple Stupid (KISS)
Related to the idea of constraints supporting creativity--dead simple things, done /again and again/ are extremely powerful.
* Alexander technique
* Start simple and workable, and then unfold to something more complex.
  By induction, if you can progress from complexity k to k + 1, you
  can progress infinitely.
  
  Over time, I've gotten to know the amazing beast that is org mode.
  It is astounding how much you can do—but perhaps even more
  impressive is that you can start doing it on the first day. You can
  learn in 5 minutes how to create headlines, expand and collapse
  nodes, write text, etc. That is not hard.
  
  This, I feel, should be part of my life philosophy. Wanna start a
  self-reflective practice? Make it extremely, dead, simple at first.
  Make it solid. Then, gradually, you can build from there. But you
  need that foundation to be laid down first, otherwise things are all
  like the kids who took caffeine or steroids...stunted growth, or
  premature experience.
  
  Simple life philosophy. Simple running routine. Simple
  self-reflection routine. To start out with.
f Simulate having a conversation with someone.
  This works shockingly well in sort of being rational about things and hashing out points. Like imagine with Ian, or Chris, or someone very level-headed. Or simulate Sid for certain things. Or visakanv. Imagine DMing him with your problem.
* Practice Time vs. Performance Time.
:PROPERTIES:
:ID:       5c10a46c-9a85-4821-b6a8-3afffce72726
:END:
* While holding one frame, respect other (even contradicting) frames.
* Noticing assumptions and questioning them.
Assumptions, in my view, are synonymous with constraints. Powerful if you have a good set, but they should be dynamic.
* learn from the masters.
:PROPERTIES:
:ID:       6f220af9-0d79-4557-b900-085b7551dd6b
:END:
* Build your ideas.
* Nuking everything and starting over.
* [[http://www.paulgraham.com/head.html][Holding a program in one's head]]
Ooooh I really like this PG article. This, but generalized to any procedure/[[file:frames.org][frame]]/etc.
* Have you tried playing with a toy example?
  If you're struggling to understand something, *examples help*.
* Lightness / playfulness / lightness / playfulness / lightness / playfulness
* creative destruction
rewriting a program, for example
* Wayfinding => Mastery
** 1. Seek Sense-making tools like [[https://www.quantamagazine.org/the-map-of-mathematics-20200213/][map of mathematics]]
** 2. Start by mastering one node on the map, then move on to something else
** 3. Mastery?? [unfinished]
* You will die someday.
* Have good form / fundamentals
** For example: Typing, exercise
** [[https://twitter.com/visakanv/status/1029925579552739328?s=20][visakanv on good form in relationships]]
* [[file:decomposition.org][decomposition]]
* Going back to the formal definitions.
* Build a solid foundation, and then work from there.
* Just kinda start building vague associations and everything works out (knowledge graph)
* Taking the patterns you've seen so far, and generalizing them.
This is why everyone's particulars influence their worldview so much--they pattern-match, and because of our leaky, non-compartmentalized brains, they generalize. The model's usefulness can be shaky tho, sometimes we're observing truly general patterns, but sometimes we're just observing patterns that are specific to our slice of reality. Experience and worldview are deeply intertwined.
* debugging frame
* storing everything as "config files" for my life
  (dotfiles repo contains...everything?? my workout config, my posture config, my relationship configs, etc.)
* What is the actual meaningful *content*?
* Maximalism, minimalism
* Mindfulness/I-mode
  being able to step out when you've gone down an unproductive/too deep into the task tree. Effective backtracking.
* Sense of wonder at the way the world is
* Transmuting one type of "energy" to another
Like...pent-up frustrations into a stream of focused productivity. Wielding it instead of letting it drive me insane.
* Time
** [[https://www.ribbonfarm.com/2014/05/10/two-examples-of-narrative-time/][Expanding narrative time]]
* Life/habits as subroutines to be executed
