frames.html
<div id="outline-container-orgcdcba01" class="outline-2">
<h2 id="orgcdcba01"><i>mise en place</i></h2>
<div class="outline-text-2" id="text-orgcdcba01">
<p>
Set up the kitchen before cooking.
</p>
</div>
</div>
<div id="outline-container-org6b389c0" class="outline-2">
<h2 id="org6b389c0">Sometimes, when there are explosively many choices, just take the greedy option and</h2>
</div>
<div id="outline-container-orgcb60797" class="outline-2">
<h2 id="orgcb60797">Changing the settings</h2>
<div class="outline-text-2" id="text-orgcb60797">
<p>
like in this thought (link is slow &#x2013; hmm&#x2026;how could I improve this?)
</p>
</div>
</div>
<div id="outline-container-org0cfab24" class="outline-2">
<h2 id="org0cfab24"><a href="marrs_levels.html">Marr&rsquo;s levels</a></h2>
</div>
<div id="outline-container-org2ef154c" class="outline-2">
<h2 id="org2ef154c">structure as a constraint that leads to creativity.</h2>
<div class="outline-text-2" id="text-org2ef154c">
<p>
Like, it prevents you from spending too much time in the &ldquo;config layer.&rdquo; Spend more time in the execution layer. But the perennial question is, &ldquo;how much structure is too much structure?&rdquo;
</p>
</div>
</div>
<div id="outline-container-orga10ea14" class="outline-2">
<h2 id="orga10ea14">Constraints =&gt; creativity</h2>
<div class="outline-text-2" id="text-orga10ea14">
</div>
</div>
<div id="outline-container-orgf1d90e9" class="outline-2">
<h2 id="orgf1d90e9">(avoid) competitive mindset</h2>
</div>
<div id="outline-container-org69f60e7" class="outline-2">
<h2 id="org69f60e7">Subtree frame vs. separate page frame</h2>
<div class="outline-text-2" id="text-org69f60e7">
<p>
In the context of zettelkasten. These should be interchangeable, imo. (Yet another argument for a graph database backend 😅)
</p>
</div>
</div>
<div id="outline-container-orgb009dcc" class="outline-2">
<h2 id="orgb009dcc">Constantly staying in motion. Embracing change.</h2>
</div>
<div id="outline-container-org4c0d6e6" class="outline-2">
<h2 id="org4c0d6e6">you are what you eat.</h2>
</div>
<div id="outline-container-org57b5874" class="outline-2">
<h2 id="org57b5874">Repeatedly asking why. Get to the root.</h2>
</div>
<div id="outline-container-orgcb90635" class="outline-2">
<h2 id="orgcb90635">Light, playful frame.</h2>
</div>
<div id="outline-container-org4240cd1" class="outline-2">
<h2 id="org4240cd1">Constraints</h2>
</div>
<div id="outline-container-orgbe6d4fd" class="outline-2">
<h2 id="orgbe6d4fd">Keep It Simple Stupid (KISS)</h2>
<div class="outline-text-2" id="text-orgbe6d4fd">
<p>
Related to the idea of constraints supporting creativity&#x2013;dead simple things, done <i>again and again</i> are extremely powerful.
</p>
</div>
</div>
<div id="outline-container-orgdd330aa" class="outline-2">
<h2 id="orgdd330aa">Alexander technique</h2>
</div>
<div id="outline-container-orga27f7ce" class="outline-2">
<h2 id="orga27f7ce">Start simple and workable, and then unfold to something more complex.</h2>
<div class="outline-text-2" id="text-orga27f7ce">
<p>
By induction, if you can progress from complexity k to k + 1, you
can progress infinitely.
</p>

<p>
Over time, I&rsquo;ve gotten to know the amazing beast that is org mode.
It is astounding how much you can do—but perhaps even more
impressive is that you can start doing it on the first day. You can
learn in 5 minutes how to create headlines, expand and collapse
nodes, write text, etc. That is not hard.
</p>

<p>
This, I feel, should be part of my life philosophy. Wanna start a
self-reflective practice? Make it extremely, dead, simple at first.
Make it solid. Then, gradually, you can build from there. But you
need that foundation to be laid down first, otherwise things are all
like the kids who took caffeine or steroids&#x2026;stunted growth, or
premature experience.
</p>

<p>
  Simple life philosophy. Simple running routine. Simple
  self-reflection routine. To start out with.
f Simulate having a conversation with someone.
  This works shockingly well in sort of being rational about things and hashing out points. Like imagine with Ian, or Chris, or someone very level-headed. Or simulate Sid for certain things. Or visakanv. Imagine DMing him with your problem.
</p>
</div>
</div>
<div id="outline-container-orgd6711ce" class="outline-2">
<h2 id="orgd6711ce">Practice Time vs. Performance Time.</h2>
<div class="outline-text-2" id="text-orgd6711ce">
</div>
</div>
<div id="outline-container-org7daa2d5" class="outline-2">
<h2 id="org7daa2d5">While holding one frame, respect other (even contradicting) frames.</h2>
</div>
<div id="outline-container-org9b9eb96" class="outline-2">
<h2 id="org9b9eb96">Noticing assumptions and questioning them.</h2>
<div class="outline-text-2" id="text-org9b9eb96">
<p>
Assumptions, in my view, are synonymous with constraints. Powerful if you have a good set, but they should be dynamic.
</p>
</div>
</div>
<div id="outline-container-org73a95b2" class="outline-2">
<h2 id="org73a95b2">learn from the masters.</h2>
<div class="outline-text-2" id="text-org73a95b2">
</div>
</div>
<div id="outline-container-org97eb4de" class="outline-2">
<h2 id="org97eb4de">Build your ideas.</h2>
</div>
<div id="outline-container-org721d3d0" class="outline-2">
<h2 id="org721d3d0">Nuking everything and starting over.</h2>
</div>
<div id="outline-container-org55d01f8" class="outline-2">
<h2 id="org55d01f8"><a href="http://www.paulgraham.com/head.html">Holding a program in one&rsquo;s head</a></h2>
<div class="outline-text-2" id="text-org55d01f8">
<p>
Ooooh I really like this PG article. This, but generalized to any procedure/<a href="frames.html">frame</a>/etc.
</p>
</div>
</div>
<div id="outline-container-org1537608" class="outline-2">
<h2 id="org1537608">Have you tried playing with a toy example?</h2>
<div class="outline-text-2" id="text-org1537608">
<p>
If you&rsquo;re struggling to understand something, <b>examples help</b>.
</p>
</div>
</div>
<div id="outline-container-org0e5ab24" class="outline-2">
<h2 id="org0e5ab24">Lightness / playfulness / lightness / playfulness / lightness / playfulness</h2>
</div>
<div id="outline-container-orgb37424c" class="outline-2">
<h2 id="orgb37424c">creative destruction</h2>
<div class="outline-text-2" id="text-orgb37424c">
<p>
rewriting a program, for example
</p>
</div>
</div>
<div id="outline-container-orgf693b74" class="outline-2">
<h2 id="orgf693b74">Wayfinding =&gt; Mastery</h2>
<div class="outline-text-2" id="text-orgf693b74">
</div>
<div id="outline-container-org0439b23" class="outline-3">
<h3 id="org0439b23">1. Seek Sense-making tools like <a href="https://www.quantamagazine.org/the-map-of-mathematics-20200213/">map of mathematics</a></h3>
</div>
<div id="outline-container-org954e74a" class="outline-3">
<h3 id="org954e74a">2. Start by mastering one node on the map, then move on to something else</h3>
</div>
<div id="outline-container-org557eeb4" class="outline-3">
<h3 id="org557eeb4">3. Mastery?? [unfinished]</h3>
</div>
</div>
<div id="outline-container-orgc60e61a" class="outline-2">
<h2 id="orgc60e61a">You will die someday.</h2>
</div>
<div id="outline-container-orgad580e9" class="outline-2">
<h2 id="orgad580e9">Have good form / fundamentals</h2>
<div class="outline-text-2" id="text-orgad580e9">
</div>
<div id="outline-container-org7cccc61" class="outline-3">
<h3 id="org7cccc61">For example: Typing, exercise</h3>
</div>
<div id="outline-container-orgfcb012b" class="outline-3">
<h3 id="orgfcb012b"><a href="https://twitter.com/visakanv/status/1029925579552739328?s=20">visakanv on good form in relationships</a></h3>
</div>
</div>
<div id="outline-container-orgb878c34" class="outline-2">
<h2 id="orgb878c34"><a href="decomposition.html">decomposition</a></h2>
</div>
<div id="outline-container-org077c552" class="outline-2">
<h2 id="org077c552">Going back to the formal definitions.</h2>
</div>
<div id="outline-container-orga2ec3c8" class="outline-2">
<h2 id="orga2ec3c8">Build a solid foundation, and then work from there.</h2>
</div>
<div id="outline-container-org5d6bf97" class="outline-2">
<h2 id="org5d6bf97">Just kinda start building vague associations and everything works out (knowledge graph)</h2>
</div>
<div id="outline-container-org52b0354" class="outline-2">
<h2 id="org52b0354">Taking the patterns you&rsquo;ve seen so far, and generalizing them.</h2>
<div class="outline-text-2" id="text-org52b0354">
<p>
This is why everyone&rsquo;s particulars influence their worldview so much&#x2013;they pattern-match, and because of our leaky, non-compartmentalized brains, they generalize. The model&rsquo;s usefulness can be shaky tho, sometimes we&rsquo;re observing truly general patterns, but sometimes we&rsquo;re just observing patterns that are specific to our slice of reality. Experience and worldview are deeply intertwined.
</p>
</div>
</div>
<div id="outline-container-org9a05ddf" class="outline-2">
<h2 id="org9a05ddf">debugging frame</h2>
</div>
<div id="outline-container-org310879f" class="outline-2">
<h2 id="org310879f">storing everything as &ldquo;config files&rdquo; for my life</h2>
<div class="outline-text-2" id="text-org310879f">
<p>
(dotfiles repo contains&#x2026;everything?? my workout config, my posture config, my relationship configs, etc.)
</p>
</div>
</div>
<div id="outline-container-org0dbad70" class="outline-2">
<h2 id="org0dbad70">What is the actual meaningful <b>content</b>?</h2>
</div>
<div id="outline-container-orgce4ce2f" class="outline-2">
<h2 id="orgce4ce2f">Maximalism, minimalism</h2>
</div>
<div id="outline-container-orgfd3c91d" class="outline-2">
<h2 id="orgfd3c91d">Mindfulness/I-mode</h2>
<div class="outline-text-2" id="text-orgfd3c91d">
<p>
being able to step out when you&rsquo;ve gone down an unproductive/too deep into the task tree. Effective backtracking.
</p>
</div>
</div>
<div id="outline-container-org7218658" class="outline-2">
<h2 id="org7218658">Sense of wonder at the way the world is</h2>
</div>
<div id="outline-container-orgf710ea4" class="outline-2">
<h2 id="orgf710ea4">Transmuting one type of &ldquo;energy&rdquo; to another</h2>
<div class="outline-text-2" id="text-orgf710ea4">
<p>
Like&#x2026;pent-up frustrations into a stream of focused productivity. Wielding it instead of letting it drive me insane.
</p>
</div>
</div>
<div id="outline-container-orge877e3c" class="outline-2">
<h2 id="orge877e3c">Time</h2>
<div class="outline-text-2" id="text-orge877e3c">
</div>
<div id="outline-container-org419499f" class="outline-3">
<h3 id="org419499f"><a href="https://www.ribbonfarm.com/2014/05/10/two-examples-of-narrative-time/">Expanding narrative time</a></h3>
</div>
</div>
<div id="outline-container-org80404df" class="outline-2">
<h2 id="org80404df">Life/habits as subroutines to be executed</h2>
</div>
