frames.org
* What's the point? 
  (Hierarchy of "why"s that end in ... long-term Goals? biological base desires? The stochastic nature of the universe?)
* peoplewatching through different lenses.
** Sonder - everyone else's existences are just as complex.
** Interactions - what information's being exchanged?
** sexual tension
** Interactions across race/gender/etc.
* Sensory deprivation => resensitization
* What are my "labels" that I'm training on? What is my training data?
  Like, it's all about having good supervision. this relates back to Tell said "track your macros - what's measured gets managed." You need to know the truth.
* *Search* as a tool to create things
* Good, old-fashioned hard work.
MJ worked his ass off and became the best basketball player known to man. Of course, you need talent and luck. He had those too. But you also need grueling, hard work to get to the top. Solid Habits.
* Actively try to fail. Put yourself in the path of failure.
:PROPERTIES:
:ID:       74802074-7706-4d39-939c-5d501ae21bb4
:END:
* 100 blocks per day. 10 minutes per block.
* Staying stateless.
