frames.html
<div id="outline-container-org6043e2e" class="outline-2">
<h2 id="org6043e2e">What&rsquo;s the point?</h2>
<div class="outline-text-2" id="text-org6043e2e">
<p>
(Hierarchy of &ldquo;why&rdquo;s that end in &#x2026; long-term Goals? biological base desires? The stochastic nature of the universe?)
</p>
</div>
</div>
<div id="outline-container-orgdc66d7a" class="outline-2">
<h2 id="orgdc66d7a">peoplewatching through different lenses.</h2>
<div class="outline-text-2" id="text-orgdc66d7a">
</div>
<div id="outline-container-orgb364105" class="outline-3">
<h3 id="orgb364105">Sonder - everyone else&rsquo;s existences are just as complex.</h3>
</div>
<div id="outline-container-org6134010" class="outline-3">
<h3 id="org6134010">Interactions - what information&rsquo;s being exchanged?</h3>
</div>
<div id="outline-container-orgc48e8f6" class="outline-3">
<h3 id="orgc48e8f6">sexual tension</h3>
</div>
<div id="outline-container-org003c26b" class="outline-3">
<h3 id="org003c26b">Interactions across race/gender/etc.</h3>
</div>
</div>
<div id="outline-container-orga234567" class="outline-2">
<h2 id="orga234567">Sensory deprivation =&gt; resensitization</h2>
</div>
<div id="outline-container-orgeb5bc7c" class="outline-2">
<h2 id="orgeb5bc7c">What are my &ldquo;labels&rdquo; that I&rsquo;m training on? What is my training data?</h2>
<div class="outline-text-2" id="text-orgeb5bc7c">
<p>
Like, it&rsquo;s all about having good supervision. this relates back to Tell said &ldquo;track your macros - what&rsquo;s measured gets managed.&rdquo; You need to know the truth.
</p>
</div>
</div>
<div id="outline-container-orga3c1f76" class="outline-2">
<h2 id="orga3c1f76"><b>Search</b> as a tool to create things</h2>
</div>
<div id="outline-container-org041069e" class="outline-2">
<h2 id="org041069e">Good, old-fashioned hard work.</h2>
<div class="outline-text-2" id="text-org041069e">
<p>
MJ worked his ass off and became the best basketball player known to man. Of course, you need talent and luck. He had those too. But you also need grueling, hard work to get to the top. Solid Habits.
</p>
</div>
</div>
<div id="outline-container-org368ae14" class="outline-2">
<h2 id="org368ae14">Actively try to fail. Put yourself in the path of failure.</h2>
<div class="outline-text-2" id="text-org368ae14">
</div>
</div>
<div id="outline-container-orga5184b3" class="outline-2">
<h2 id="orga5184b3">100 blocks per day. 10 minutes per block.</h2>
</div>
<div id="outline-container-org264d335" class="outline-2">
<h2 id="org264d335">Staying stateless.</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ketan Agrawal</p>
<p class="date">Created: 2021-04-15 Thu 22:22</p>
</div>
</body>
</html>
